Revit 2024 API
LinePatternSegment Class
 Represents a segment in a line pattern.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class LinePatternSegment : IDisposable
Visual Basic
Public Class LinePatternSegment _
	Implements IDisposable
Visual C++
public ref class LinePatternSegment : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.LinePatternSegment
See Also
LinePatternSegment Members
Autodesk.Revit.DB Namespace